import { Collapse, Grid, Text } from '@nextui-org/react'
import { type FC } from 'react'

import { Footer, TextPage } from '@/components'

export const PrivacyPolicyPage: FC = () => {
    return (
        <>
            {/* <Meta noindex>Політика конфіденційності</Meta> */}

            <TextPage>
                <Grid>
                    <Collapse
                        shadow
                        divider={false}
                        title="Політика конфіденційності"
                        subtitle="Ми рекомендуємо вам ознайомитися з нею перед користуванням нашого сайту або послугами."
                    >
                        <Text>
                            Ця політика конфіденційності описує наші зобов`язання щодо захисту вашої
                            приватності та персональних даних. Ми поважаємо приватність наших
                            клієнтів і користувачів сайту. Ця політика конфіденційності пояснює, як
                            ми збираємо, використовуємо, захищаємо та розкриваємо вашу особисту
                            інформацію.
                        </Text>
                    </Collapse>
                </Grid>
                <Grid>
                    <Collapse.Group shadow divider={false}>
                        <Collapse title="Які дані ми збираємо">
                            <Text>
                                Ми можемо збирати різну інформацію, що стосується вас, включаючи,
                                але не обмежуючись, ваше ім`я, електронну адресу, телефон, адресу та
                                інші контактні дані. Ми також можемо збирати інформацію про вашу
                                компанію та ваші інтереси щодо реклами.
                            </Text>
                        </Collapse>
                        <Collapse title="Як ми використовуємо вашу інформацію">
                            <Text>
                                Ми використовуємо вашу інформацію, щоб забезпечити вам послуги з
                                оренди рекламних площин, зв`язатися з вами щодо вашого запиту та
                                повідомити вас про нові можливості. Ми можемо також використовувати
                                вашу інформацію для статистичних цілей та поліпшення наших послуг.
                            </Text>
                        </Collapse>
                        <Collapse title="Як ми захищаємо вашу інформацію">
                            <Text>
                                Ми застосовуємо розумні технічні та організаційні заходи для захисту
                                вашої інформації від несанкціонованого доступу, використання,
                                розголошення, зміни або видалення.
                            </Text>
                        </Collapse>
                        <Collapse title="Розкриття вашої інформації">
                            <Text>
                                Ми можемо розкривати вашу інформацію, якщо це необхідно для надання
                                послуг, відповіді на запит або дотримання законодавства. Ми можемо
                                також розкривати вашу інформацію контрагентам, які працюють з нами,
                                щоб забезпечити надання послуг та поліпшення якості наших послуг.
                            </Text>
                        </Collapse>
                        <Collapse title="Посилання на сторонні сайти">
                            <Text>
                                Наш сайт може містити посилання на сторонні веб-сайти. Ми не несемо
                                відповідальності за політики конфіденційності цих сайтів. Ми радимо
                                вам ознайомитися з політикою конфіденційності цих сайтів перед
                                використанням їх послуг.
                            </Text>
                        </Collapse>
                        <Collapse title="Зміни в Політиці конфіденційності">
                            <Text>
                                Ми можемо час від часу змінювати цю політику конфіденційності. Якщо
                                ми внесемо зміни, ми повідомимо вас про це на нашому сайті.
                            </Text>
                        </Collapse>
                        <Collapse title="Контактна інформація">
                            <Text>
                                Якщо у вас є питання або коментарі щодо цієї політики
                                конфіденційності, будь ласка, зв`яжіться з нами за допомогою нашої
                                контактної інформації, яка наведена на нашому сайті.
                            </Text>
                        </Collapse>
                    </Collapse.Group>
                </Grid>
            </TextPage>
            <Footer />
        </>
    )
}
