import { Collapse, Grid, Text } from '@nextui-org/react'
import { type FC } from 'react'

import { Footer, TextPage } from '@/components'

export const TermsOfUsePage: FC = () => {
    return (
        <>
            {/* <Meta noindex>Правила та умови використання</Meta> */}

            <TextPage>
                <Grid>
                    <Collapse
                        shadow
                        divider={false}
                        title="Правила та умови використання"
                        subtitle="Ми рекомендуємо вам ознайомитися з нею перед користуванням нашого сайту або послугами."
                    >
                        <Text>
                            Ці Правила та умови використання є договоро між вами та нами, який
                            регулює ваш доступ до цього сайту та його використання. Будь-яке
                            порушення цих Правил може призвести до заборони на доступ до сайту.
                        </Text>
                    </Collapse>
                </Grid>
                <Grid>
                    <Collapse.Group shadow divider={false}>
                        <Collapse title="Прийняття умов">
                            <Text>
                                При користуванні цим сайтом ви приймаєте Правила та умови
                                використання, які регулюють ваш доступ до цього сайту та його
                                використання. Якщо ви не погоджуєтесь з цими умовами, ви повинні
                                припинити користуватись сайтом.
                            </Text>
                        </Collapse>
                        <Collapse title="Права на інтелектуальну власність">
                            <Text>
                                Матеріали на цьому сайті, включаючи, але не обмежуючись, текст,
                                зображення, відео, графіку, логотипи та інші матеріали, захищені
                                авторськими правами та іншими законами про інтелектуальну власність.
                                Ви не маєте права копіювати, редагувати, розповсюджувати,
                                публікувати, передавати або використовувати ці матеріали без нашої
                                попередньої згоди.
                            </Text>
                        </Collapse>
                        <Collapse title="Обмеження відповідальності">
                            <Text>
                                Ми не несемо відповідальності за будь-які шкоди, включаючи прямі,
                                непрямі, випадкові, спеціальні або побічні шкоди, що виникають в
                                результаті використання або неможливості використання цього сайту
                                або його матеріалів.
                            </Text>
                        </Collapse>
                        <Collapse title="Користування сайтом">
                            <Text>
                                Ви зобов`язані користуватись цим сайтом лише відповідно до законів
                                та норм моралі та етики, не заважати іншим користувачам сайту, не
                                використовувати цей сайт з будь-якими незаконними або шкідливими
                                цілями.
                            </Text>
                        </Collapse>
                        <Collapse title="Зміни в Правилах та умовах використання">
                            <Text>
                                Ми можемо в будь-який момент змінити Правила та умови використання
                                без попереднього повідомлення. Будь-які зміни будуть негайно
                                опубліковані на сайті. Ви повинні періодично переглядати Правила та
                                умови використання для того, щоб бути в курсі будь-яких змін.
                            </Text>
                        </Collapse>
                        <Collapse title="Користування кукі-файлами">
                            <Text>
                                Цей сайт може використовувати кукі-файли (маленькі файли, які
                                зберігаються на вашому пристрої), щоб покращити функціональність
                                сайту та надати вам більш персоналізований досвід користування. Ви
                                можете вимкнути кукі-файли в налаштуваннях вашого веб-браузера, але
                                це може призвести до обмеження функціональності сайту.
                            </Text>
                        </Collapse>
                        <Collapse title="Зворотній зв'язок">
                            <Text>
                                Якщо у вас є запитання або пропозиції щодо Правил та умов
                                використання цього сайту, будь ласка, зв`яжіться з нами.
                            </Text>
                        </Collapse>
                    </Collapse.Group>
                </Grid>
            </TextPage>
            <Footer />
        </>
    )
}
