import { type QuestionAnswer } from '@/pages/Main/components/types'

export const questions: QuestionAnswer[] = [
    {
        question: 'Чому реклама на бордах - хороший вибір?',
        answer: 'Найголовніші переваги бордів - це їх доступна вартість, вони помітні та красиві та не викликають негативної реакції у аудиторії (на відміну від навʼязливих роликів на телебаченні або в інтернеті). До того ж, борди працюють цілодобово',
    },
    {
        question: 'Як відбувається співпраця?',
        answer: 'Спершу укладаємо договір з 50% авансом, друга частина оплати після друку, повного виконання роботи та фотозвіту (друк - 1-2, робота - 4-5 робочих днів)',
    },
    {
        question: 'Яка вартість розміщення?',
        answer: 'Вартість розміщення реклами на білбордах невисока. Вона залежить від місця розташування обʼєкта, сторони, на яку ви хочете поставити свою рекламу, тривалості оренди, кількості орендованих бордів та інших факторів',
    },
    {
        question: 'Що входить у вартість?',
        answer: 'У вартість входить розміщення реклами та оренда площини протягом одного місяця',
    },
    {
        question: 'Скільки часу займає виконання роботи?',
        answer: 'Друк макету займає 1-2, а поклейка - 4-5 робочих днів',
    },
    {
        question: 'Який матеріал для друку підійде саме Вам?',
        answer: 'Якщо період оренди більший, ніж 3 місяці, то найкращим варіантом буде банер - цупкий та міцний матеріал. У іншому випадку Вам підійде папір - дешевший, але менш надійний матеріал',
    },
    {
        question: 'Які розміри бордів ви пропонуєте?',
        answer: 'У нас є білборди (3х6) метри та арки (3х18) метрів',
    },
    {
        question: 'Немає дизайну?',
        answer: 'Ми зробимо оригінальний та візуально привабливий дизайн, адже від цього залежить успіх просування продукту, товару або послуги на ринку',
    },
]
